import turtle    #יבוא סיפרייה חיצונית בשם טורטל


class Scoreboard(turtle.Turtle):   #(הורשה ממחלקת טורטל) מחלקה בשם לוח תוצאות - אחראית על תצוגת תוצאת המשחק על גבי המסך ושמירת הניקוד
    def __init__(self):        #מתודת אתחול של המחלקה
        super().__init__()        # (אב קדמון=טורטל) אתחול אב קדמון
        self.score = 0            #הגדרת ציון אפס במשתנה
        self.color("white")       #הגדרת צבע לבן
        self.penup()              #הגדרה לציור על המסך - הגדרה פנימית של האב הקדמון
        self.hideturtle()         #הגדרה לציור על המסך - הגדרה פנימית של האב הקדמון
        self.goto(0, 260)         #הגדרת המיקום של לוח התוצאות על המסך
        self.update_score()       #מתודה שמעדכנת את לוח התוצאות על המסך - שימוש בפועל של המתודה שהגדרנו

    def update_score(self):       #מתודה לעדכון לוח התוצאות 
        self.clear()           #מתודה שמוחקת את הציון הקודם בלוח התוצאות
        self.write(f"Score: {self.score}", align="center", font=("Courier", 24, "normal"))    #מעדכן את הציון החדש בלוח התוצאות

    def increase_score(self):     #מתודה להגדלת הציון בלוח התוצאות
        self.score += 1        #משנה שמעלה את הציון
        self.update_score()       #השימוש בפועל של מתודת העדכון שהגדרנו